# Description
Create database with MySQL.

Level 1

- Exercise 1

Create a simple relational database using MySQL(https://www.mysql.com/) and connect it to Python.

Level 2

- Exercise 2
Show that you can load some simple queries to a Pandas Dataframe.

Level 3

- Exercise 3
Generate a graph summarizing the data.

# Level 1

## - Exercise 1

Create a simple relational database using MySQL(https://www.mysql.com/) and connect it to Python.

We are going to use our database created in the previous task: S13_T01 and we are going to connect it to Python.

In [10]:
# Import Libraries
import pandas as pd
import mysql.connector
import os
os.sys.path.append(os.path.dirname(os.path.abspath('.')))
import Data.config as cfg

In [11]:
# Connect to database
mydb = mysql.connector.connect(**cfg.config)
print(mydb)

<mysql.connector.connection_cext.CMySQLConnection object at 0x0000017A67711340>

We have connected to our MySQL database without exposing our credentials when our notebook uploads to Github.


# Level 2

## - Exercise 2
Show that you can load some simple queries to a Pandas Dataframe.

Let's show first the databases existing in our host:

In [12]:
cursor = mydb.cursor()
cursor.execute("SHOW DATABASES")

for dbs in cursor:
  print(dbs)

('information_schema',)
('mysql',)
('performance_schema',)
('s13_t01',)
('sys',)

Let's now show the tables in our s13_t01 database:

In [13]:
cursor.execute("SHOW TABLES")

for tables in cursor:
  print(tables)

('customerstable',)
('employeestable',)
('establismenttable',)
('productstable',)
('providertable',)
('shoppingtable',)
('typeofproducts',)

Finally, lets select all registers from table "costumerstable" and then convert them to list and finally to pd.dataframe

In [15]:
cursor.execute("SELECT * FROM customerstable")

result = cursor.fetchall()

costumerslist = []
for row in result:
  costumerslist.append(row)

costumersdf = pd.DataFrame(costumerslist)
costumersdf

   0      1          2          3                         4
0  1   Pepe   Martinez  43212345H  c/Santa María, 5, Madrid
1  2   Juan      Lopez  45323245H                 Albacente
2  3   Jose     Garcia  55251111H                   Sevilla
3  4  Jesús  Fernandez  46526111J                 Barcelona

# PENDING:      

* Convert attributes of table SQL to columns name.
* Put more data in SQL table in order to do some graphic in Ex.3


# Level 3

## - Exercise 3
Generate a graph summarizing the data.

In [17]:
costumersdf.describe()

              0
count  4.000000
mean   2.500000
std    1.290994
min    1.000000
25%    1.750000
50%    2.500000
75%    3.250000
max    4.000000